api/modules/user/models/User.php

    public static function findByUsername($username)
    {
        return User::findOne(['email' => $username]);
---
SELECT * FROM `org_user` WHERE `email`='moderator'